---
kind: method
id: M:Autodesk.Revit.DB.ElementFilter.Dispose
source: html/5d3ffdf8-dce9-0724-d101-44693775671c.htm
---
# Autodesk.Revit.DB.ElementFilter.Dispose Method

Releases all resources used by the ElementFilter

## Syntax (C#)
```csharp
public void Dispose()
```